/***************************************************************************

Copyright (C), 1999-2015, Tongye Tech. Co., Ltd.

* @file           Bsp_io.c
* @author         SCH-Team
* @version        V1.0.0
* @date           2015-03-11
* @brief          IO Task

History:          // Revision Records

<Author>             <time>       <version >            <desc>

xiou             	2015-03-11       V1.0.0            input -> logic -> output

***************************************************************************/
#ifndef	__BSP_IO_H__
#define __BSP_IO_H__
#include "stm32f4xx.h"

#define  OUT_TEST_CMD          (0x01)

#define INPUT_CHANEL_MAX			 (32)
#define	OUTPUT_CHANEL_MAX			 (16)

#define FPGA_BEGIN_ADDR        (0x68000000)
#define FPGA_END_ADDR          (0x6C000000)

#define FPGA_INPUT_OFFSET      (1024)
#define FPGA_OUTPUT_OFFSET     (512)

//--------------------------------------------------------------
// 数字量滤波相关变量
//--------------------------------------------------------------
#define    IO_FLT_LENTH        (20)
#define    IO_FLT_VALIDCOUNTS  (15)

typedef struct DS_INPUTF_
{
	uint8_t    gpioVal;          // 端口原始值
	uint8_t    inVal;            // 滤波后，端口值
	uint16_t   ioHighLevels;     // 高电平次数 
	uint16_t   ioLowLevels;      // 低电平次数 
	uint16_t   FlLenth;          // 滤波区长度
	uint16_t   validCounts;      // 有效电平次数

}DS_INPUTF, *PDS_INPUTF;	

typedef struct _DS_IO_IN_
{
	/* Bit01 */    uint16_t    Chn01     	 :  1  ;  //输入通道01---系统启停信号
	/* Bit02 */    uint16_t    Chn02    	 :  1  ;  //输入通道02---1#输入熔断器
	/* Bit03 */    uint16_t    Chn03    	 :  1  ;  //输入通道03---2#输入熔断器
	/* Bit04 */    uint16_t    Chn04     	 :  1  ;  //输入通道04---1#输出熔断器
	/* Bit05 */    uint16_t    Chn05       	 :  1  ;  //输入通道05---2#输出熔断器
	/* Bit06 */    uint16_t    Chn06    	 :  1  ;  //输入通道06---3#输出熔断器
	/* Bit07 */    uint16_t    Chn07         :  1  ;  //输入通道07---4#输出熔断器
	/* Bit08 */    uint16_t    Chn08       	 :  1  ;  //输入通道08---5#输出熔断器
	/* Bit09 */    uint16_t    Chn09         :  1  ;  //输入通道09---6#输出熔断器
	/* Bit10 */    uint16_t    Chn10         :  1  ;  //输入通道10---预留
	/* Bit11 */    uint16_t    Chn11         :  1  ;  //输入通道11---预留
	/* Bit12 */    uint16_t    Chn12         :  1  ;  //输入通道12---预留
	/* Bit13 */    uint16_t    Chn13  		 :  1  ;  //输入通道13---预留
	/* Bit14 */    uint16_t    Chn14         :  1  ;  //输入通道14---预充电接触器
	/* Bit15 */    uint16_t    Chn15         :  1  ;  //输入通道15---1#主接触器反馈
	/* Bit16 */    uint16_t    Chn16         :  1  ;  //输入通道16---2#主接触器反馈

	/* Bit17 */    uint16_t    Chn17         :  1  ;  //输入通道17---预留
	/* Bit18 */    uint16_t    Chn18         :  1  ;  //输入通道18---预留
	/* Bit19 */    uint16_t    Chn19         :  1  ;  //输入通道19---1#输出接触器反馈
	/* Bit20 */    uint16_t    Chn20         :  1  ;  //输入通道20---2#输出接触器反馈
	/* Bit21 */    uint16_t    Chn21  		 :  1  ;  //输入通道21---3#输出接触器反馈
	/* Bit22 */    uint16_t    Chn22         :  1  ;  //输入通道22---4#输出接触器反馈
	/* Bit23 */    uint16_t    Chn23         :  1  ;  //输入通道23---5#输出接触器反馈
	/* Bit24 */    uint16_t    Chn24         :  1  ;  //输入通道24---预留	
	/* Bit25 */    uint16_t    Chn25         :  1  ;  //输入通道25---预留
	/* Bit26 */    uint16_t    Chn26         :  1  ;  //输入通道26---预留
	/* Bit27 */    uint16_t    Chn27         :  1  ;  //输入通道27---预留
	/* Bit28 */    uint16_t    Chn28         :  1  ;  //输入通道28---预留
	/* Bit29 */    uint16_t    Chn29  		 :  1  ;  //输入通道29---预留
	/* Bit30 */    uint16_t    Chn30         :  1  ;  //输入通道30---预留
	/* Bit31 */    uint16_t    Chn31         :  1  ;  //输入通道31---预留
	/* Bit32 */    uint16_t    Chn32         :  1  ;  //输入通道32---预留	
	
}DS_IO_IN, *PDS_IO_IN;

typedef struct _DS_IO_OUT_
{
	/* Bit01 */    uint16_t    Chn01     	:  1  ;  //输出通道01----1#输出接触器
	/* Bit02 */    uint16_t    Chn02     	:  1  ;  //输出通道02----2#输出接触器
	/* Bit03 */    uint16_t    Chn03        :  1  ;  //输出通道03----3#输出接触器
	/* Bit04 */    uint16_t    Chn04        :  1  ;  //输出通道04----4#输出接触器
	/* Bit05 */    uint16_t    Chn05        :  1  ;  //输出通道05----5#输出接触器
	/* Bit06 */    uint16_t    Chn06        :  1  ;  //输出通道06----1预留
	/* Bit07 */    uint16_t    Chn07     	:  1  ;  //输出通道07----预充电接触器
	/* Bit08 */    uint16_t    Chn08        :  1  ;  //输出通道08----1#主接触器
	/* Bit09 */    uint16_t    Chn09     	:  1  ;  //输出通道09----2#主接触器
	/* Bit10 */    uint16_t    Chn10    	:  1  ;  //输出通道10----预留
	/* Bit11 */    uint16_t    Chn11     	:  1  ;  //输出通道11----预留
	/* Bit12 */    uint16_t    Chn12    	:  1  ;  //输出通道12----预留
	/* Bit13 */    uint16_t    Chn13     	:  1  ;  //输出通道13----预留
	/* Bit14 */    uint16_t    Chn14     	:  1  ;  //输出通道14----预留
	/* Bit15 */    uint16_t    Chn15     	:  1  ;  //输出通道15----预留
	/* Bit16 */    uint16_t    Chn16     	:  1  ;  //输出通道16----预留

}DS_IO_OUT, *PDS_IO_OUT;

/*=============================================================================*/
/*******************************************************************************
*                                                                              *
*                       工程数据集  (Drive Layer)                              *
*                                                                              *
*                                                                              *
********************************************************************************/
/*=============================================================================*/

typedef struct _DS_IO_
{
	DS_IO_IN           theDS_IO_IN;
	DS_IO_OUT          theDS_IO_OUT;

}DS_IO, *PDS_IO;

/*******************************************************************************
*                                                                              *
*                       工程数据集: '引用'宏定义                               *
*                                                                              *
*                                                                              *
********************************************************************************/
/*=============================================================================*/
#define PDIO(name)             (&(theDIO.theDS_##name))
#define SDIO_(name)             (sizeof(DS_##name))

/*=============================================================================*/
/*******************************************************************************
*                                                                              *
*                       工程数据集: 结构体变量定义                             *
*                                                                              *
*                                                                              *
********************************************************************************/
/*=============================================================================*/

#ifdef DSA_IO
DS_IO	theDIO = { 0 };	
#else
extern	DS_IO	theDIO;
#endif

void IO_ReadInput(void);
void IO_WriteOutput(void);
void Bsp_Dio_Init(void);

#endif


